# -*- coding: utf-8 -*-

from room_1 import folks as folks1
from room_2 import folks as folks2

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

print('В команет room_1 живут:', ','.join(folks1))
print('В команет room_2 живут:', ','.join(folks2))
