#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Мама Светлана', 'Бабушка Наташа', 'Дедушка Петя']


# список списков приблизителного роста членов вашей семьи
my_family_height = [['Мама Светлана', 175], ['Бабушка Наташа', 168], ['Дедушка Петя', 180]]

print('Рост мамы - ', my_family_height[0][1], ' см')
print('Общий рост моей семьи -', (my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1]), ' см')


# Выведите на консоль рост мамы в формате
#   Рост мамы - ХХ см

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
